nxp-mcuxpresso/mcux-sdk/boards/frdmmcxw71/project_template/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MCXW716CxxxA
package_id: MCXW716CMFTA
mcu_data: ksdk2_0
processor_version: 0.12.6
board: FRDM-MCXW71
pin_labels:
- {pin_num: '14', pin_signal: CMP1_IN0/PTA19/WUU0_P4/LPSPI0_SCK/LPUART0_RTS_b/LPI2C0_SCL/TPM0_CH2/RF_GPO_1, label: 'Q1[1]/J1[5]/LED_G/TPM0_CH2', identifier: LED_G;LED_GREEN}
- {pin_num: '17', pin_signal: ADC0_A14/CMP0_IN3/PTA20/LPSPI0_PCS2/LPUART0_TX/EWM0_IN/TPM0_CH1/RF_GPO_2/FLEXIO0_D7, label: 'Q4[1]/J1[7]/LED_B/RF_GPO_2/TPM0_CH1', identifier: LED_B;LED_BLUE}
- {pin_num: '18', pin_signal: ADC0_A15/CMP0_IN2/PTA21/WUU0_P5/LPSPI0_PCS3/LPUART0_RX/EWM0_OUT_b/TPM0_CH0/RF_GPO_3/RF_GPO_7/FLEXIO0_D8/RF_GPO_10, label: 'Q3[1]/J1[8]/LED_R/TPM0_CH0',
  identifier: LED_R;LED_RRED;LED_RED}
- {pin_num: '11', pin_signal: ADC0_A12/PTA16/RF_NOT_ALLOWED/LPSPI0_PCS0/EWM0_OUT_b/LPI2C0_SCLS/TPM0_CH4/LPUART0_RX/RF_GPO_8/FLEXIO0_D5, label: 'U9[4]/R172/J1[1]/J13[3]/LIN_RX/UART0_RX/TPM0_CH4',
  identifier: UART0_RX;LIN_RX}
- {pin_num: '12', pin_signal: ADC0_A13/PTA17/WUU0_P3/RF_NOT_ALLOWED/LPSPI0_SIN/EWM0_IN/LPI2C0_SDAS/TPM0_CH5/LPUART0_TX/RF_GPO_7/RF_GPO_8/FLEXIO0_D6, label: 'U11[2]/R173/J1[2]/J13[4]/LIN_TX/UART0_TX/TPM0_CH5',
  identifier: UART0_TX;LIN_TX}
- {pin_num: '24', pin_signal: ADC0_B5/PTD1/SPC0_LPREQ/NMI_b/RF_GPO_4, label: 'J4[1]/J13[2]/SW2/NMI_b/ADC0_B5', identifier: SW2}
- {pin_num: '44', pin_signal: ADC0_A8/PTC6/WUU0_P11/LPSPI1_PCS1/TPM1_CH5/FLEXIO0_D22, label: 'J5[5]/SW3/LPSPI1_PCS1/WUU0_P11', identifier: SW3}
- {pin_num: '10', pin_signal: ADC0_A10/CMP0_IN0/PTA4/WUU0_P2/RF_XTAL_OUT_ENABLE/RF_GPO_9/TPM0_CLKIN/TRACE_SWO/FLEXIO0_D4/BOOT_CONFIG, label: 'JP25[3]/J4[4]/U18[12]/SW4/SWO/BOOT_CFG',
  identifier: SW4}
- {pin_num: '43', pin_signal: PTC5/LPSPI1_PCS0/CAN0_RX/LPI2C1_SDA/TPM1_CH4/TPM2_CH1/FLEXIO0_D21, label: 'U5[4]/J1[4]/CAN0_RX', identifier: CAN_RX}
- {pin_num: '42', pin_signal: PTC4/WUU0_P10/LPSPI1_SIN/CAN0_TX/LPI2C1_SCL/TPM2_CH0/FLEXIO0_D20, label: 'U8[4]/J1[3]/J13[1]/CAN0_TX', identifier: CAN_TX}
- {pin_num: '47', pin_signal: ADC0_B11/PTB1/LPSPI1_SIN/TPM1_CH1/FLEXIO0_D27, label: 'U4[2]/J2[5]/J5[9]/J12[5]/U24[4]/LPSPI1_SIN', identifier: FLASH_SIN;SPI_FLASH_SIN}
- {pin_num: '1', pin_signal: ADC0_B13/PTB3/WUU0_P14/LPSPI1_SOUT/LPUART1_RX/TPM1_CH3/FLEXIO0_D29, label: 'U4[5]/J2[4]/J5[7]/J12[6]/U24[5]/R143/LPSPI1_SOUT', identifier: SPI_FLASH_SOUT;FLASH_SOUT}
- {pin_num: '46', pin_signal: ADC0_B10/PTB0/WUU0_P13/LPSPI1_PCS0/TPM1_CH0/FLEXIO0_D26, label: 'U4[1]/Q2[1]/J1[6]/LPSPI1_PCS0/TPM1_CH0', identifier: FLASH;FLASH_CS}
- {pin_num: '48', pin_signal: ADC0_B12/PTB2/LPSPI1_SCK/LPUART1_TX/TPM1_CH2/FLEXIO0_D28, label: 'U4[6]/J2[6]/J5[11]/J12[4]/U24[3]/LPSPI1_SK', identifier: FLASH_SCK}
- {pin_num: '2', pin_signal: PTB4/WUU0_P15/LPSPI1_PCS3/LPUART1_CTS_b/LPI2C1_SDA/I3C0_SDA/TRGMUX0_IN0/FLEXIO0_D30, label: 'U4[7]/J2[3]/J12[3]/U24[6]/R146/LPSPI1_PCS3',
  identifier: FLASH_RST}
- {pin_num: '37', pin_signal: PTC0/WUU0_P7/LPSPI1_PCS2/CAN0_TX/I3C0_SDA/TPM1_CH0/LPI2C1_SCL/FLEXIO0_D16, label: 'U12[5]/J2[9]/J13[6]/U27[8]/I2C1_SCL', identifier: SENSOR_SCL;ACCEL_SCL}
- {pin_num: '38', pin_signal: PTC1/WUU0_P8/LPSPI1_PCS3/CAN0_RX/I3C0_SCL/TPM1_CH1/LPI2C1_SDA/FLEXIO0_D17, label: 'U12[4]/J2[10]/J13[5]/U27[1]/I2C1_SDA', identifier: SENSOR_SDA;ACCEL_SDA}
- {pin_num: '39', pin_signal: PTC2/WUU0_P9/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM1_CH2/I3C0_PUR/FLEXIO0_D18, label: 'U23[3]/J4[6]/UART1_RX', identifier: DEBUG_UART_RX}
- {pin_num: '40', pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM1_CH3/FLEXIO0_D19, label: 'U23[4]/J4[5]/UART1_TX', identifier: DEBUG_UART_TX}
- {pin_num: '45', pin_signal: PTC7/WUU0_P12/NMI_b/RF_NOT_ALLOWED/TRGMUX0_IN3/TRGMUX0_OUT3/SFA0_CLK/TPM1_CLKIN/TPM2_CLKIN/CLKOUT/FLEXIO0_D23, label: 'U11[1]/J6[10]/WUU0_P12',
  identifier: LIN_SLP}
- {pin_num: '13', pin_signal: CMP1_IN1/PTA18/LPSPI0_SOUT/LPUART0_CTS_b/LPI2C0_SDA/TPM0_CH3/RF_GPO_0/LPUART0_RX, label: 'J6[8]/J2[2]'}
- {pin_num: '3', pin_signal: PTB5/LPSPI1_PCS2/LPUART1_RTS_b/LPI2C1_SCL/I3C0_SCL/TRGMUX0_OUT0/FLEXIO0_D31, label: 'J6[6]/J2[1]/U4[3]/U12[8]/LPSPI1_PCS2/INT_COMBO'}
- {pin_num: '8', pin_signal: PTA0/WUU0_P0/CMP0_OUT/LPUART0_CTS_b/RF_GPO_11/TPM0_CH4/FLEXIO0_D0/SWD_DIO, label: 'U18[16]/SWD_DIO'}
- {pin_num: '9', pin_signal: PTA1/CMP1_OUT/LPUART0_RTS_b/RF_GPO_10/TPM0_CH5/FLEXIO0_D1/SWD_CLK, label: 'U18[4]/SWD_CLK'}
- {pin_num: '25', pin_signal: ADC0_A6/PTD2/LPTMR0_ALT3/TAMPER0/RF_GPO_5, label: 'J4[2]/R70/PMIC_SYSRST/ADC0_A6/PMIC_SYSRST'}
- {pin_num: '26', pin_signal: ADC0_B6/PTD3/LPTMR1_ALT3/TAMPER1/RF_GPO_6/TRGMUX0_IN2, label: 'J4[3]/INT_B_PMIC/AD0_B6'}
- {pin_num: '27', pin_signal: XTAL32K/PTD4/LPTMR0_ALT2/TAMPER2, label: 'R130/Y2[1]/PTD4_XTAL32K'}
- {pin_num: '28', pin_signal: EXTAL32K/PTD5/LPTMR1_ALT2, label: 'R131/Y2[2]/PTD5_EXTAL32K'}
- {pin_num: '23', pin_signal: ADC0_A5/PTD0/RESET_b, label: 'SW1/JP18[2]/J12[2]/J3[3]/U18[8]/RST_TGTMCU_b'}
- {pin_num: '5', pin_signal: SWITCH_WAKEUP_B, label: TP1}
- {pin_num: '6', pin_signal: VDD_SWITCH, label: 'JP4[1]/VDD_SWITCH'}
- {pin_num: '7', pin_signal: VOUT_SWITCH, label: 'JP6[3]/VOUT_SWITCH'}
- {pin_num: '15', pin_signal: VDD_LDO_CORE, label: 'JP12[1]'}
- {pin_num: '16', pin_signal: VDD_CORE/VOUT_CORE, label: 'JP15[1]'}
- {pin_num: '19', pin_signal: VSS_DCDC, label: GND}
- {pin_num: '20', pin_signal: DCDC_LX, label: R1}
- {pin_num: '21', pin_signal: VDD_IO_D/VDD_DCDC, label: 'JP7[2]/R39'}
- {pin_num: '29', pin_signal: VDD_ANA, label: 'JP9[2]'}
- {pin_num: '30', pin_signal: VREFO, label: 'J2[8]/VREF_OUT'}
- {pin_num: '31', pin_signal: XTAL_OUT, label: TP2}
- {pin_num: '32', pin_signal: XTAL, label: 'Y1[1]/XTAL_RF'}
- {pin_num: '33', pin_signal: EXTAL, label: 'Y1[3]/R40/EXTAL_RF'}
- {pin_num: '34', pin_signal: VDD_RF, label: 'JP14[2]'}
- {pin_num: '35', pin_signal: ANT_2P4GHZ, label: ANT}
- {pin_num: '36', pin_signal: VPA_2P4GHZ, label: 'JP11[1]/VDD_PA_2G4'}
- {pin_num: '41', pin_signal: VDD_CORE, label: 'JP15[1]'}
- {pin_num: '4', pin_signal: VDD_IO_ABC, label: 'JP8[4]/JP8[3]/U9[6]/U11[8]/U5[6]/U8[6]/U12[7]/R170/R171/R174/VDD_IO_ABC_MCU/VCC_TGMCU'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

