nxp-mcuxpresso/mcux-sdk/boards/frdmmcxw71/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACCELPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACCELPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t ACCEL_SCL = {/* Internal pull-up resistor is enabled */
                                         (uint16_t)kPORT_PullUp,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPI2C1_SCL */
                                         (uint16_t)kPORT_MuxAlt7,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTC0 (pin 37) is configured as LPI2C1_SCL */
    PORT_SetPinConfig(BOARD_INITACCELPINS_ACCEL_SCL_PORT, BOARD_INITACCELPINS_ACCEL_SCL_PIN, &ACCEL_SCL);

    const port_pin_config_t ACCEL_SDA = {/* Internal pull-up resistor is enabled */
                                         (uint16_t)kPORT_PullUp,
                                         /* Low internal pull resistor value is selected. */
                                         (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPI2C1_SDA */
                                         (uint16_t)kPORT_MuxAlt7,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         (uint16_t)kPORT_UnlockRegister};
    /* PORTC1 (pin 38) is configured as LPI2C1_SDA */
    PORT_SetPinConfig(BOARD_INITACCELPINS_ACCEL_SDA_PORT, BOARD_INITACCELPINS_ACCEL_SDA_PIN, &ACCEL_SDA);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLINPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '11', peripheral: LPUART0, signal: RX, pin_signal: ADC0_A12/PTA16/RF_NOT_ALLOWED/LPSPI0_PCS0/EWM0_OUT_b/LPI2C0_SCLS/TPM0_CH4/LPUART0_RX/RF_GPO_8/FLEXIO0_D5,
    identifier: LIN_RX, pull_select: up, pull_enable: enable, slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '12', peripheral: LPUART0, signal: TX, pin_signal: ADC0_A13/PTA17/WUU0_P3/RF_NOT_ALLOWED/LPSPI0_SIN/EWM0_IN/LPI2C0_SDAS/TPM0_CH5/LPUART0_TX/RF_GPO_7/RF_GPO_8/FLEXIO0_D6,
    identifier: LIN_TX, pull_select: up, pull_enable: enable, slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '45', peripheral: GPIOC, signal: 'GPIO, 7', pin_signal: PTC7/WUU0_P12/NMI_b/RF_NOT_ALLOWED/TRGMUX0_IN3/TRGMUX0_OUT3/SFA0_CLK/TPM1_CLKIN/TPM2_CLKIN/CLKOUT/FLEXIO0_D23,
    direction: OUTPUT, gpio_init_state: 'true', pull_select: down, pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLINPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLINPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioC);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t LIN_SLP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 45)  */
    GPIO_PinInit(BOARD_INITLINPINS_LIN_SLP_GPIO, BOARD_INITLINPINS_LIN_SLP_PIN, &LIN_SLP_config);

    const port_pin_config_t LIN_RX = {/* Internal pull-up resistor is enabled */
                                      (uint16_t)kPORT_PullUp,
                                      /* Low internal pull resistor value is selected. */
                                      (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as LPUART0_RX */
                                      (uint16_t)kPORT_MuxAlt6,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      (uint16_t)kPORT_UnlockRegister};
    /* PORTA16 (pin 11) is configured as LPUART0_RX */
    PORT_SetPinConfig(BOARD_INITLINPINS_LIN_RX_PORT, BOARD_INITLINPINS_LIN_RX_PIN, &LIN_RX);

    const port_pin_config_t LIN_TX = {/* Internal pull-up resistor is enabled */
                                      (uint16_t)kPORT_PullUp,
                                      /* Low internal pull resistor value is selected. */
                                      (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as LPUART0_TX */
                                      (uint16_t)kPORT_MuxAlt6,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      (uint16_t)kPORT_UnlockRegister};
    /* PORTA17 (pin 12) is configured as LPUART0_TX */
    PORT_SetPinConfig(BOARD_INITLINPINS_LIN_TX_PORT, BOARD_INITLINPINS_LIN_TX_PIN, &LIN_TX);

    const port_pin_config_t LIN_SLP = {/* Internal pull-up/down resistor is disabled */
                                       (uint16_t)kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       (uint16_t)kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       (uint16_t)kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       (uint16_t)kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       (uint16_t)kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       (uint16_t)kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       (uint16_t)kPORT_NormalDriveStrength,
                                       /* Pin is configured as PTC7 */
                                       (uint16_t)kPORT_MuxAsGpio,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       (uint16_t)kPORT_UnlockRegister};
    /* PORTC7 (pin 45) is configured as PTC7 */
    PORT_SetPinConfig(BOARD_INITLINPINS_LIN_SLP_PORT, BOARD_INITLINPINS_LIN_SLP_PIN, &LIN_SLP);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
